app/controllers/cities_controller.rb

  def show
    @city = @state.cities.find(params[:id])
---
SELECT * FROM `cities` WHERE (`cities`.`id` = 4 AND (`cities`.state_id = 1))

  def edit
    @city = @state.cities.find(params[:id])
---
SELECT * FROM `cities` WHERE (`cities`.`id` = 4 AND (`cities`.state_id = 1))

  def create
    @city = @state.cities.new(params[:city])

    respond_to do |format|
      if @city.save
---
INSERT INTO `cities` (`name`, `created_at`, `updated_at`, `population`, `state_id`) VALUES('numbai', '2009-06-16 06:15:27', '2009-06-16 06:15:27', 100000.0, 1)

  def update
    @city = @state.cities.find(params[:id])
---
SELECT * FROM `cities` WHERE (`cities`.`id` = 4 AND (`cities`.state_id = 1))

  def destroy
    @city = @state.cities.find(params[:id])
    @city.destroy
---
SELECT * FROM `cities` WHERE (`cities`.`id` = 3 AND (`cities`.state_id = 1))
DELETE FROM `cities` WHERE `id` = 3

  def load_state
  	@state = State.find(params[:state_id])
---
SELECT * FROM `states` WHERE (`states`.`id` = 1)