app/controllers/homes_controller.rb

SELECT * FROM `homes`
---
  def index
    @homes = Home.all