app/controllers/states_controller.rb

SELECT * FROM `states`
---
  def index
    @states = State.all

SELECT * FROM `states` WHERE (`states`.`id` = 1)
---
  def show
    @state = State.find(params[:id])

INSERT INTO `states` (`name`, `created_at`, `updated_at`, `population`) VALUES('Maharashtra', '2009-06-16 06:01:30', '2009-06-16 06:01:30', 10000000.0)
---
  def create
    @state = State.new(params[:state])

    respond_to do |format|
      if @state.save

SELECT * FROM `states`
---
  def ajax_demo
  	@states = State.all

SELECT * FROM `states` WHERE (`states`.`id` = 1)
---
  def city_list
    @state = State.find(params[:state_id])

SELECT * FROM `states` WHERE (`states`.`id` = 2)
---
  def state_population
  		@state = State.find(params[:state_id])

SELECT * FROM `states` WHERE (`states`.`id` = 2)
SELECT * FROM `cities` WHERE (`cities`.`id` = 4 AND (`cities`.state_id = 1))
---
  def state_city_population
   	@state = State.find(params[:state_id])
    @city = @state.cities.find(params[:city_id])